; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-3-24)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p2-1 - location
	p3-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s3)
	(at driver5 s3)
	(at driver6 s1)
	(at driver7 s0)
	(at driver8 s3)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at package1 s0)
	(at package2 s1)
	(at package3 s0)
	(at package4 s2)
	(at package5 s2)
	(at package6 s2)
	(at package7 s1)
	(at package8 s1)
	(at package9 s3)
	(at package10 s2)
	(at package11 s3)
	(at package12 s1)
	(at package13 s2)
	(at package14 s2)
	(at package15 s2)
	(at package16 s3)
	(at package17 s1)
	(at package18 s2)
	(at package19 s2)
	(at package20 s3)
	(at package21 s3)
	(at package22 s0)
	(at package23 s2)
	(at package24 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s3 s2)
	(link s2 s3)
)
	(:goal (and
	(at driver3 s3)
	(at driver4 s2)
	(at driver5 s0)
	(at driver6 s0)
	(at driver7 s1)
	(at truck1 s2)
	(at truck2 s1)
	(at package1 s3)
	(at package2 s2)
	(at package5 s3)
	(at package6 s3)
	(at package7 s2)
	(at package8 s1)
	(at package9 s3)
	(at package10 s3)
	(at package12 s0)
	(at package14 s0)
	(at package15 s2)
	(at package16 s1)
	(at package17 s2)
	(at package19 s3)
	(at package20 s2)
	(at package21 s1)
	(at package22 s3)
	(at package23 s1)
	(at package24 s0)
	))


)

; plan
1. (board-truck driver4 s3 truck3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 4 of 26
2. (drive-truck driver4 s3 s1 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 4 of 26
3. (drive-truck driver4 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 4 of 26
4. (load-truck s2 package6 truck3)
   deleted: (at package6 s2)
   added: (in package6 truck3)
   goals met: 4 of 26
5. (load-truck s2 package5 truck3)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   goals met: 4 of 26
6. (load-truck s2 package24 truck3)
   deleted: (at package24 s2)
   added: (in package24 truck3)
   goals met: 4 of 26
7. (load-truck s2 package23 truck3)
   deleted: (at package23 s2)
   added: (in package23 truck3)
   goals met: 4 of 26
8. (drive-truck driver4 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 4 of 26
9. (load-truck s1 package7 truck3)
   deleted: (at package7 s1)
   added: (in package7 truck3)
   goals met: 4 of 26
10. (drive-truck driver4 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 4 of 26
11. (unload-truck s2 package7 truck3)
   deleted: (in package7 truck3)
   added: (at package7 s2)
   goals met: 5 of 26
12. (load-truck s2 package19 truck3)
   deleted: (at package19 s2)
   added: (in package19 truck3)
   goals met: 5 of 26
13. (drive-truck driver4 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 5 of 26
14. (unload-truck s1 package23 truck3)
   deleted: (in package23 truck3)
   added: (at package23 s1)
   goals met: 6 of 26
15. (load-truck s1 package2 truck3)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 6 of 26
16. (drive-truck driver4 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 6 of 26
17. (unload-truck s2 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 7 of 26
18. (load-truck s2 package14 truck3)
   deleted: (at package14 s2)
   added: (in package14 truck3)
   goals met: 7 of 26
19. (load-truck s2 package10 truck3)
   deleted: (at package10 s2)
   added: (in package10 truck3)
   goals met: 7 of 26
20. (drive-truck driver4 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 7 of 26
21. (drive-truck driver4 s1 s3 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 7 of 26
22. (unload-truck s3 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s3)
   goals met: 8 of 26
23. (unload-truck s3 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   goals met: 9 of 26
24. (drive-truck driver4 s3 s1 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 9 of 26
25. (load-truck s1 package17 truck3)
   deleted: (at package17 s1)
   added: (in package17 truck3)
   goals met: 9 of 26
26. (drive-truck driver4 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 9 of 26
27. (unload-truck s2 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s2)
   goals met: 10 of 26
28. (board-truck driver3 s2 truck2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 26
29. (drive-truck driver4 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 10 of 26
30. (unload-truck s0 package24 truck3)
   deleted: (in package24 truck3)
   added: (at package24 s0)
   goals met: 11 of 26
31. (load-truck s0 package22 truck3)
   deleted: (at package22 s0)
   added: (in package22 truck3)
   goals met: 11 of 26
32. (drive-truck driver4 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 11 of 26
33. (drive-truck driver4 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 11 of 26
34. (unload-truck s3 package22 truck3)
   deleted: (in package22 truck3)
   added: (at package22 s3)
   goals met: 12 of 26
35. (load-truck s3 package21 truck3)
   deleted: (at package21 s3)
   added: (in package21 truck3)
   goals met: 12 of 26
36. (load-truck s3 package20 truck3)
   deleted: (at package20 s3)
   added: (in package20 truck3)
   goals met: 12 of 26
37. (unload-truck s3 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s3)
   goals met: 13 of 26
38. (drive-truck driver4 s3 s1 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 13 of 26
39. (unload-truck s1 package21 truck3)
   deleted: (in package21 truck3)
   added: (at package21 s1)
   goals met: 14 of 26
40. (drive-truck driver4 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 14 of 26
41. (unload-truck s2 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s2)
   goals met: 15 of 26
42. (drive-truck driver3 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 16 of 26
43. (walk driver5 s3 p0-3)
   deleted: (at driver5 s3)
   added: (at driver5 p0-3)
   goals met: 16 of 26
44. (walk driver5 p0-3 s0)
   deleted: (at driver5 p0-3)
   added: (at driver5 s0)
   goals met: 17 of 26
45. (walk driver6 s1 p0-1)
   deleted: (at driver6 s1)
   added: (at driver6 p0-1)
   goals met: 17 of 26
46. (walk driver6 p0-1 s0)
   deleted: (at driver6 p0-1)
   added: (at driver6 s0)
   goals met: 18 of 26
47. (walk driver7 s0 p0-1)
   deleted: (at driver7 s0)
   added: (at driver7 p0-1)
   goals met: 18 of 26
48. (walk driver7 p0-1 s1)
   deleted: (at driver7 p0-1)
   added: (at driver7 s1)
   goals met: 19 of 26
49. (load-truck s1 package12 truck2)
   deleted: (at package12 s1)
   added: (in package12 truck2)
   goals met: 19 of 26
50. (drive-truck driver4 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 19 of 26
51. (unload-truck s0 package14 truck3)
   deleted: (in package14 truck3)
   added: (at package14 s0)
   goals met: 20 of 26
52. (drive-truck driver4 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 20 of 26
53. (drive-truck driver4 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 20 of 26
54. (load-truck s3 package16 truck3)
   deleted: (at package16 s3)
   added: (in package16 truck3)
   goals met: 20 of 26
55. (unload-truck s3 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s3)
   goals met: 21 of 26
56. (drive-truck driver4 s3 s1 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 21 of 26
57. (unload-truck s1 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s1)
   goals met: 22 of 26
58. (drive-truck driver4 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 22 of 26
59. (load-truck s0 package1 truck3)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 22 of 26
60. (drive-truck driver4 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 22 of 26
61. (drive-truck driver4 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 22 of 26
62. (unload-truck s3 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 23 of 26
63. (drive-truck driver4 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 23 of 26
64. (disembark-truck driver4 s2 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s2) (empty truck3)
   goals met: 24 of 26
65. (drive-truck driver3 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 23 of 26
66. (unload-truck s0 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s0)
   goals met: 24 of 26
67. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 25 of 26
68. (drive-truck driver3 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 24 of 26
69. (disembark-truck driver3 s3 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 25 of 26
70. (board-truck driver8 s3 truck2)
   deleted: (at driver8 s3) (empty truck2)
   added: (driving driver8 truck2)
   goals met: 25 of 26
71. (drive-truck driver8 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 26 of 26
